In [1]:
import pandas as pd
 #importing pandas

In [8]:
df1 = pd.DataFrame({
    "city": ["Mumbai","Pune","Nagpur"],
    "Temp": [37,32,39]
                   })
df1

#created dataset 1

     city  Temp
0  Mumbai    37
1    Pune    32
2  Nagpur    39

In [10]:
df2 = pd.DataFrame({"city": ["Mumbai","Pune","Nashik","Goa"],
                   "Temp": [36,30,27,29]
                   })
df2
#created dataset 2

     city  Temp
0  Mumbai    36
1    Pune    30
2  Nashik    27
3     Goa    29

In [11]:
df3 = pd.merge(df1, df2, on="city")
df3
#merge datasets 1 and 2

     city  Temp_x  Temp_y
0  Mumbai      37      36
1    Pune      32      30

In [12]:
df3 = pd.merge(df1, df2, on="city", how="outer")
df3
#outer join- all values

     city  Temp_x  Temp_y
0  Mumbai    37.0    36.0
1    Pune    32.0    30.0
2  Nagpur    39.0     NaN
3  Nashik     NaN    27.0
4     Goa     NaN    29.0

In [13]:
df3 = pd.merge(df1, df2, on="city", how="inner")
df3
#inner join - only common values

     city  Temp_x  Temp_y
0  Mumbai      37      36
1    Pune      32      30

In [14]:
df3 = pd.merge(df1, df2, on="city", how="left")
df3
#left join - common and only left dataset values

     city  Temp_x  Temp_y
0  Mumbai      37    36.0
1    Pune      32    30.0
2  Nagpur      39     NaN

In [15]:
df3 = pd.merge(df1, df2, on="city", how="right")
df3
#right join - common and only right datset values

     city  Temp_x  Temp_y
0  Mumbai    37.0      36
1    Pune    32.0      30
2  Nashik     NaN      27
3     Goa     NaN      29

In [16]:
df3 = pd.merge(df1, df2, on="city", how="outer", indicator = True)
df3
#outer join with indicator to acknowledge from which dataset data is from

     city  Temp_x  Temp_y      _merge
0  Mumbai    37.0    36.0        both
1    Pune    32.0    30.0        both
2  Nagpur    39.0     NaN   left_only
3  Nashik     NaN    27.0  right_only
4     Goa     NaN    29.0  right_only

In [18]:
df3 = pd.merge(df1, df2, on="city", how="outer", indicator = True, suffixes= ("_left" , "_right"))
df3
#added suffixes left and right

     city  Temp_left  Temp_right      _merge
0  Mumbai       37.0        36.0        both
1    Pune       32.0        30.0        both
2  Nagpur       39.0         NaN   left_only
3  Nashik        NaN        27.0  right_only
4     Goa        NaN        29.0  right_only

In [19]:
pd.concat([df1,df2])
#concatenating both datasets

     city  Temp
0  Mumbai    37
1    Pune    32
2  Nagpur    39
0  Mumbai    36
1    Pune    30
2  Nashik    27
3     Goa    29

In [20]:
pd.concat([df1,df2],ignore_index = True)
#concatenating both datasets ignoring index

     city  Temp
0  Mumbai    37
1    Pune    32
2  Nagpur    39
3  Mumbai    36
4    Pune    30
5  Nashik    27
6     Goa    29